Revit 2024 API
BuiltInFailures.RoofFailures.RoofMeetsRoofTangentiallyError Property
 The roofs cannot be joined because the roof being joined meets the target roof tangentially.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoofMeetsRoofTangentiallyError { get; }
Visual Basic
Public Shared ReadOnly Property RoofMeetsRoofTangentiallyError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoofMeetsRoofTangentiallyError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace